cf_billing/InformationRegisters/энргНомерПломбПриборовУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНомерПломбПриборовУчетаМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерПломбы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПломбы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицоУстановившееПломбу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПломбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыПломб</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМестаУстановкиПломб</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеПриборовМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеПриборовМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНомерПломбПриборовУчетаМКД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет номера пломб введенных приборов действующих точек.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура НомераПломбВведенныхПриборовДействующихТочек(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	ПредыдущееИмяТаблицы 	= "ВведенныеПриборыДействующихТочек";
	ИспользоватьУзлыМКД		= энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД();
	Если Схема = Неопределено Тогда
		ПолучитьСхемуАктивныхПриборовУчета(Схема, ПараметрыОтбора, ПредыдущееИмяТаблицы, ИспользоватьУзлыМКД);
	Иначе
		ЕстьДействующиеНомераПозицииПломб	= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = ПредыдущееИмяТаблицы Тогда
				ЕстьДействующиеНомераПозицииПломб = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьДействующиеНомераПозицииПломб Тогда
			ПолучитьСхемуАктивныхПриборовУчета(Схема, ПараметрыОтбора, ПредыдущееИмяТаблицы, ИспользоватьУзлыМКД);
		КонецЕсли; 		 		
	КонецЕсли;
		
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));		
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНомераПломбВведенныхПриборовДействующихТочек(ИспользоватьУзлыМКД));
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Запрос.Операторы[0].Источники[0].Источник.Параметры;	
	ПараметрыВторойТаблицы				= Источник.Запрос.Операторы[1].Источники[0].Источник.Параметры;	
	ПараметрПериод 						= Параметры[0];
	ПараметрПериодВторойТаблицы			= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 				= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);
		ПараметрПериодВторойТаблицы.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		Отбор 							= ОператорВыбора.Отбор;		
		ДоступныеПараметры 				= "Организация, Район, МКД, ПриборУчета, МестоУстановки";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);				
	КонецЕсли;
	
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьСхемуАктивныхПриборовУчета(Схема, Параметры, ПредыдущееИмяТаблицы, ИспользоватьУзлыМКД)
	Если ИспользоватьУзлыМКД Тогда
		РегистрыСведений.энргСостояниеПриборовМКД.АктивныеПриборыУчетаМКД(Схема, Параметры, ПредыдущееИмяТаблицы);
	Иначе
		РегистрыСведений.энргСостояниеПриборовМКД.ДействующиеПриборыУчетаМКД(Схема, Параметры, ПредыдущееИмяТаблицы); 		
	КонецЕсли;
КонецПроцедуры

Функция ТекстЗапросаНомераПломбВведенныхПриборовДействующихТочек(ИспользоватьУзлыМКД)
	Если ИспользоватьУзлыМКД Тогда
		Возврат ТекстЗапросаОпломбированныеПриборыУчетаСУзлом();
	Иначе		
		Возврат ТекстЗапросаОпломбированныеПриборыУчетаБезУзла();
	КонецЕсли; 	
КонецФункции

Функция ТекстЗапросаОпломбированныеПриборыУчетаБезУзла()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргНомерПломбПриборовУчетаМКДСрезПоследних.Организация КАК Организация,
	|	энргНомерПломбПриборовУчетаМКДСрезПоследних.Район КАК Район,
	|	энргНомерПломбПриборовУчетаМКДСрезПоследних.МКД КАК МКД,
	|	энргНомерПломбПриборовУчетаМКДСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргНомерПломбПриборовУчетаМКДСрезПоследних.МестоУстановки КАК МестоУстановки,
	|	энргНомерПломбПриборовУчетаМКДСрезПоследних.НомерПломбы КАК НомерПломбы
	|ИЗ
	|	РегистрСведений.энргНомерПломбПриборовУчетаМКД.СрезПоследних(
	|			,
	|			(Организация, Район, МКД, ПриборУчета) В
	|				(ВЫБРАТЬ
	|					ВведенныеПриборыДействующихТочек.Организация,
	|					ВведенныеПриборыДействующихТочек.Район,
	|					ВведенныеПриборыДействующихТочек.МКД,
	|					ВведенныеПриборыДействующихТочек.ПриборУчета
	|				ИЗ
	|					ВведенныеПриборыДействующихТочек КАК ВведенныеПриборыДействующихТочек)) КАК энргНомерПломбПриборовУчетаМКДСрезПоследних
	|ГДЕ
	|	энргНомерПломбПриборовУчетаМКДСрезПоследних.Состояние";
	
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаОпломбированныеПриборыУчетаСУзлом()
	
	Текст  =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.МестоУстановки КАК МестоУстановки,
	|	ВложенныйЗапрос.НомерПломбы КАК НомерПломбы
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргНомерПломбПриборовУчетаМКДСрезПоследних.Организация КАК Организация,
	|		энргНомерПломбПриборовУчетаМКДСрезПоследних.Район КАК Район,
	|		энргНомерПломбПриборовУчетаМКДСрезПоследних.МКД КАК МКД,
	|		энргНомерПломбПриборовУчетаМКДСрезПоследних.ПриборУчета КАК ПриборУчета,
	|		энргНомерПломбПриборовУчетаМКДСрезПоследних.МестоУстановки КАК МестоУстановки,
	|		энргНомерПломбПриборовУчетаМКДСрезПоследних.НомерПломбы КАК НомерПломбы
	|	ИЗ
	|		РегистрСведений.энргНомерПломбПриборовУчетаМКД.СрезПоследних(
	|				,
	|				(Организация, Район, МКД, ПриборУчета) В
	|					(ВЫБРАТЬ
	|						ВведенныеПриборыДействующихТочек.Организация,
	|						ВведенныеПриборыДействующихТочек.Район,
	|						ВведенныеПриборыДействующихТочек.МКД,
	|						ВведенныеПриборыДействующихТочек.ПриборУчета
	|					ИЗ
	|						ВведенныеПриборыДействующихТочек КАК ВведенныеПриборыДействующихТочек)) КАК энргНомерПломбПриборовУчетаМКДСрезПоследних
	|	ГДЕ
	|		энргНомерПломбПриборовУчетаМКДСрезПоследних.Состояние
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргНомерПломбПриборовУчетаМКДСрезПоследних.Организация,
	|		энргНомерПломбПриборовУчетаМКДСрезПоследних.Район,
	|		энргНомерПломбПриборовУчетаМКДСрезПоследних.МКД,
	|		энргНомерПломбПриборовУчетаМКДСрезПоследних.ПриборУчета,
	|		энргНомерПломбПриборовУчетаМКДСрезПоследних.МестоУстановки,
	|		энргНомерПломбПриборовУчетаМКДСрезПоследних.НомерПломбы
	|	ИЗ
	|		РегистрСведений.энргНомерПломбПриборовУчетаМКД.СрезПоследних(
	|				,
	|				(Организация, Район, МКД, ПриборУчета) В
	|					(ВЫБРАТЬ
	|						ВведенныеПриборыДействующихТочек.Организация,
	|						ВведенныеПриборыДействующихТочек.Район,
	|						ВведенныеПриборыДействующихТочек.МКД,
	|						ВведенныеПриборыДействующихТочек.ПриборУчета
	|					ИЗ
	|						ВведенныеПриборыДействующихТочек КАК ВведенныеПриборыДействующихТочек)) КАК энргНомерПломбПриборовУчетаМКДСрезПоследних
	|	ГДЕ
	|		энргНомерПломбПриборовУчетаМКДСрезПоследних.Состояние) КАК ВложенныйЗапрос";
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецЕсли
